Documents/ЗаявкаНаВозврат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЗаявкаНаВозврат</Name>
			<BasedOn>
				<xr:Item>Document.РеализацияТоваровУслуг</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаИзмененияЭтапаЭкспертизы</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Реализация</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СертифицированнаяТорговаяТочка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребуетсяОтправкаТовараКлиенту</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШтампВерсии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтапЭкспертизы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЭтапыЭкспретизы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОформленоНаПланшете</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Водитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭлПочтаКлиента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>IDСклада_СтороннийСклад</Name>
							<Comment>СправочникСсылка.СторонниеСклады</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.СторонниеСклады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерСтрокиИзРТУ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Статус</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодСтрокиКМ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Факт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КодыМаркировки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КодСтрокиКМ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодМаркировки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ШтрихкодыНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/КонтактнаяИнформация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>КонтактнаяИнформация</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Представление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле3</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле4</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле5</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле6</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле7</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле8</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле9</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле10</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеПоУмолчанию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипДома</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДомов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипКорпуса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКорпусов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипКвартиры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКвартир</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛицаКонтрагентов</v8:Type>
						<v8:Type>cfg:CatalogRef.ЛичныеКонтакты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Вид</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ТипыКонтактнойИнформации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыКонтактнойИнформации</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Адрес</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Телефон</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АдресЭлектроннойПочты</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВебСтраница</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Другое</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Skype</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Факс</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыОперацийОплатаОтПокупателяПлатежнойКартой.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыОперацийОплатаОтПокупателяПлатежнойКартой</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОплатаПокупателя</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратДенежныхСредствПокупателю</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ЗаявкаНаВозврат/Ext/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		
		Реализация = ДанныеЗаполнения.Ссылка;
		СертифицированнаяТорговаяТочка = Реализация.Грузополучатель.СертифицированнаяТорговаяТочка; 
		
	КонецЕсли;  
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если РольДоступна("РедактированиеЗаявокНаВозвратВЗакрытомПериоде") Тогда
		ЭтотОбъект.ДополнительныеСвойства.Вставить("НеВыполнятьПроверкуНаДатыЗапрета", Истина);
	КонецЕсли;
	
	ДатаНачалаПроверкиКратностиНоменклатуры = Константы.ДатаНачалаПроверкиКратностиНоменклатуры.Получить();
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение И 
		ЗначениеЗаполнено(ДатаНачалаПроверкиКратностиНоменклатуры) И
		НачалоДня(ДатаНачалаПроверкиКратностиНоменклатуры) <= НачалоДня(Дата) Тогда 
		
		ТаблицаТоваров = Товары.Выгрузить(,"Номенклатура,Количество");
		ТаблицаТоваров.Свернуть("Номенклатура", "Количество");
		
		Для Каждого ТекСтр Из ТаблицаТоваров Цикл
			
			Если НЕ МСК.ПроверкаНоменклатурыНаКратность(ТекСтр.Номенклатура,ТекСтр.Количество)  Тогда 
				
				Отказ = Истина;
				#Если Клиент Тогда
					Сообщить("Для номенклатуры " + ТекСтр.Номенклатура + " нарушена КРАТНОСТЬ!!"); 
				#КонецЕсли 
				
			КонецЕсли;
			
		КонецЦикла; 
		
	КонецЕсли;
	
	ЕстьРекламация = Ложь;
    ЕстьВозврат    = Ложь;
	
	ТаблицаТоваров = Товары.Выгрузить(,"Номенклатура,Тип");
    ТаблицаТоваров.Свернуть("Номенклатура,Тип");
	
	Для Каждого ТекСтр Из ТаблицаТоваров Цикл
		
		Если ТекСтр.Тип      = "Рекламация" Тогда 		
			ЕстьРекламация   = Истина;
		ИначеЕсли ТекСтр.Тип = "Возврат" Тогда
	        ЕстьВозврат      = Истина;
		КонецЕсли;		
		
	КонецЦикла;
	
	Если ЕстьРекламация И ТаблицаТоваров.Количество() > 1 Тогда
		
		Отказ = Истина;
		
		#Если Клиент Тогда
			Предупреждение("Разделите документ по видам возврата (возврат/рекламация)." + Символы.ПС + "Рекламации необходимо разделить на отдельные документы.", 30, "ВНИМАНИЕ !!!");	
		#КонецЕсли		
		
	КонецЕсли;	
	
	Если ЭтоНовый() Тогда

		ЕстьРекламация = Товары.НайтиСтроки(Новый Структура("Тип,IDСклада_СтороннийСклад", "Рекламация", Справочники.СторонниеСклады.ПустаяСсылка())).Количество() > 0;
		
		//+Сёмин Р.И. 12.05.2026 #UT10-5807
		Если ДополнительныеСвойства.Свойство("ЗаполнятьКомментарийДляРекламации") Тогда
			ЗаполнятьКомментарийДляРекламации = ДополнительныеСвойства.ЗаполнятьКомментарийДляРекламации;
		Иначе
			ЗаполнятьКомментарийДляРекламации = Истина;
		КонецЕсли;
		
		//Если ЕстьРекламация Тогда
		Если ЕстьРекламация И ЗаполнятьКомментарийДляРекламации Тогда
		//-Сёмин Р.И. 12.05.2026 #UT10-5807

			ПочтаДляРекламаций = СокрЛП(Константы.ЭлектронныйАдресДляРекламаций.Получить());
			
			Если ЗначениеЗаполнено(ПочтаДляРекламаций) Тогда

				КомментарийДляРекламации = "Пришлите нам на почту " + ПочтаДляРекламаций 
				+ " сканы акта рекламации, 2 заказ-нарядов(снятие/установка) и фотографии детали. В теме письма укажите номер заявки, оформленной на портале";

				КомментарийЗаполнен      = Найти(Комментарий,КомментарийДляРекламации);
				
				Если КомментарийЗаполнен = 0 Тогда
					
					Если Найти(Комментарий,ПочтаДляРекламаций) = 0 Тогда
						Комментарий = СокрЛП(Комментарий) + " " + КомментарийДляРекламации;
					КонецЕсли;
					
				КонецЕсли;					 
				
			КонецЕсли;	
			
		КонецЕсли;
		
	КонецЕсли; 

КонецПроцедуры


#Если Клиент Тогда

Функция ПечатьПретензии() Экспорт
		
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ЗаявкаНаВозврат";
	Макет = ПолучитьМакет("Претензия");
	
	ЗапросШапка = Новый Запрос;
	ЗапросШапка.Текст = 
	"ВЫБРАТЬ
	|	ЗаявкаНаВозврат.Реализация,
	|	ВЫБОР
	|		КОГДА ЗаявкаНаВозврат.Реализация.ДоговорКонтрагента.ЛицевойСчет
	|			ТОГДА "" -------""
	|		ИНАЧЕ ЗаявкаНаВозврат.Реализация.Контрагент.ИНН
	|	КОНЕЦ КАК ИНН,
	|	ВЫБОР
	|		КОГДА ЗаявкаНаВозврат.Реализация.Контрагент.КПП = """"
	|				ИЛИ ЗаявкаНаВозврат.Реализация.ДоговорКонтрагента.ЛицевойСчет
	|			ТОГДА "" -------""
	|		ИНАЧЕ ЗаявкаНаВозврат.Реализация.Контрагент.КПП
	|	КОНЕЦ КАК КПП,
	|	ЕСТЬNULL(КонтактнаяИнформация.Представление, """") КАК ЮрАдрес,
	|	ЗаявкаНаВозврат.Реализация.Организация.Наименование КАК ОрганизацияНаименование,
	|	ЗаявкаНаВозврат.Реализация.Организация.ИНН КАК ОрганизацияИНН,
	|	ЗаявкаНаВозврат.Реализация.Организация.КПП КАК ОрганизацияКПП,
	|	ЗаявкаНаВозврат.Номер КАК Номер,
	|	ЗаявкаНаВозврат.Дата КАК Дата,
	|	ЗаявкаНаВозврат.Комментарий КАК ТекстКомментарий,
	|	ЗаявкаНаВозврат.Реализация.Контрагент.НаименованиеПолное КАК Контрагент,
	|	ЗаявкаНаВозврат.Реализация.ДоговорКонтрагента.ЛицевойСчет КАК ЛицевойСчет
	|ИЗ
	|	Документ.ЗаявкаНаВозврат КАК ЗаявкаНаВозврат
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|		ПО ЗаявкаНаВозврат.Реализация.Контрагент = КонтактнаяИнформация.Объект
	|			И (КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес))
	|			И (КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮрАдресКонтрагента))
	|ГДЕ
	|	ЗаявкаНаВозврат.Ссылка = &Ссылка";
	
	ЗапросШапка.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
	
	ВыборкаШапка = ЗапросШапка.Выполнить().Выбрать();
	
	Если ВыборкаШапка.Следующий() Тогда

		СчетФактура = УчетНДС.НайтиПодчиненныйДокумент(ЭтотОбъект.Реализация, "СчетФактураВыданный"); 
		
		Если ЗначениеЗаполнено(СчетФактура) Тогда
			
			НомерУПД = СчетФактура.Номер;
			ДатаУПД = СчетФактура.Дата;
			
		Иначе
			
			НомерУПД = ВыборкаШапка.Реализация.Номер;
			ДатаУПД = ВыборкаШапка.Реализация.Дата;
			
		КонецЕсли;
	
		Обл = Макет.ПолучитьОбласть("Заголовок");
		Обл.Параметры.Заполнить(ВыборкаШапка);		     
		Обл.Параметры.ТекстДоговор = "В рамках договора" + ?(ВыборкаШапка.ЛицевойСчет, " оферты", " поставки") + " с " + ВыборкаШапка.ОрганизацияНаименование + " ИНН/КПП " +
		ВыборкаШапка.ОрганизацияИНН + "/" + ВыборкаШапка.ОрганизацияКПП + " по УПД № " + НомерУПД +
		" от " + Формат(ДатаУПД, "ДФ=dd.MM.yyyy") + " нами были получены следующие позиции: "; 
		ТабДокумент.Вывести(Обл);
		
		Обл = Макет.ПолучитьОбласть("Шапка");	
		ТабДокумент.Вывести(Обл);

	КонецЕсли;
	
	ЗапросТЧ = Новый Запрос;
	ЗапросТЧ.Текст = 
	"ВЫБРАТЬ
	|	ЗаявкаНаВозвратТовары.Ссылка,
	|	ЗаявкаНаВозвратТовары.НомерСтроки,
	|	ЗаявкаНаВозвратТовары.Номенклатура,
	|	ЗаявкаНаВозвратТовары.Количество,
	|	ЗаявкаНаВозвратТовары.Цена,
	|	ЗаявкаНаВозвратТовары.Сумма,
	|	ЗаявкаНаВозвратТовары.Тип,
	|	ЗаявкаНаВозвратТовары.Статус,
	|	ЗаявкаНаВозвратТовары.ЕдиницаИзмерения,
	|	ЗаявкаНаВозвратТовары.Комментарий,
	|	ЗаявкаНаВозвратТовары.IDСклада_СтороннийСклад,
	|	ЗаявкаНаВозвратТовары.Номенклатура.КодПроизводителя КАК Артикул,
	|	ЗаявкаНаВозвратТовары.Номенклатура.Родитель КАК Производитель
	|ИЗ
	|	Документ.ЗаявкаНаВозврат.Товары КАК ЗаявкаНаВозвратТовары
	|ГДЕ
	|	ЗаявкаНаВозвратТовары.Ссылка = &Ссылка";
	
	ЗапросТЧ.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
	
	ИтогоСумма = 0;
	ВыборкаТЧ = ЗапросТЧ.Выполнить().Выбрать();
	
	Пока ВыборкаТЧ.Следующий() Цикл
		
		Обл = Макет.ПолучитьОбласть("Строка");
		Обл.Параметры.Заполнить(ВыборкаТЧ);
		ТабДокумент.Вывести(Обл);
		ИтогоСумма = ИтогоСумма + ВыборкаТЧ.Сумма;
		
	КонецЦикла;
	
	Обл = Макет.ПолучитьОбласть("Подвал");
	Обл.Параметры.Заполнить(ВыборкаШапка);
	Обл.Параметры.Сумма = ИтогоСумма;
	Обл.Параметры.ТекстКомментарий = "";
	ТабДокумент.Вывести(Обл);
	
	Для Сч = 1 По 57 - ТабДокумент.ВысотаТаблицы Цикл
		
		Обл = Макет.ПолучитьОбласть("ПустаяСтрока");
		ТабДокумент.Вывести(Обл);
		
	КонецЦикла;
	
	Обл = Макет.ПолучитьОбласть("Низ");
	Обл.Параметры.Заполнить(ВыборкаШапка);
	Обл.Параметры.Сумма = ИтогоСумма;
	Обл.Параметры.ВремяПечати = ТекущаяДата();
	ТабДокумент.Вывести(Обл);
		
	Возврат ТабДокумент;
		
КонецФункции

Функция ПечатьВозврата() Экспорт     
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ЗаявкаНаВозврат";
	Макет = ПолучитьМакет("Возврат");
	
	ЗапросШапка = Новый Запрос;
	ЗапросШапка.Текст = 
	"ВЫБРАТЬ
	|	ЗаявкаНаВозврат.Реализация,
	|	ЗаявкаНаВозврат.Реализация.Контрагент КАК Поставщик,
	|	ЗаявкаНаВозврат.Реализация.Контрагент.ИНН КАК ИНН,
	|	ЗаявкаНаВозврат.Реализация.Контрагент.КПП КАК КПП,
	|	КонтактнаяИнформация.Представление КАК ЮрАдрес,
	|	ЗаявкаНаВозврат.Реализация.Организация.Наименование КАК ОрганизацияНаименование,
	|	ЗаявкаНаВозврат.Реализация.Организация.ИНН КАК ОрганизацияИНН,
	|	ЗаявкаНаВозврат.Реализация.Организация.КПП КАК ОрганизацияКПП,
	|	ЗаявкаНаВозврат.Номер КАК Номер,
	|	ЗаявкаНаВозврат.Дата КАК Дата,
	|	ЗаявкаНаВозврат.Реализация.Номер,
	|	ЗаявкаНаВозврат.Реализация.Дата,
	|	ЗаявкаНаВозврат.Реализация.Грузополучатель КАК филиал,
	|	ЗаявкаНаВозврат.Комментарий КАК Примечание,
	|	ЕСТЬNULL(СчетФактураВыданный.Номер, """") КАК СФНомер,
	|	ЕСТЬNULL(СчетФактураВыданный.Дата, """") КАК СФДата
	|ИЗ
	|	Документ.ЗаявкаНаВозврат КАК ЗаявкаНаВозврат
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|		ПО ЗаявкаНаВозврат.Ссылка = КонтактнаяИнформация.Объект
	|			И (КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес))
	|			И (КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮрАдресКонтрагента))
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный КАК СчетФактураВыданный
	|		ПО СчетФактураВыданный.ДокументОснование = ЗаявкаНаВозврат.Реализация
	|ГДЕ
	|	ЗаявкаНаВозврат.Ссылка = &Ссылка";  
	
	ЗапросШапка.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
	
	ВыборкаШапка = ЗапросШапка.Выполнить().Выбрать();  
	
	РеализацияНомер = "";
	РеализацияДата = "";
	
	ТипВозврата = "";
	ВозвратТовара = "";
	ЗапросШапкаРекламация = Новый Запрос;
	ЗапросШапкаРекламация.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЗаявкаНаВозвратТовары.Тип,
	|	ЗаявкаНаВозвратТовары.Ссылка
	|ПОМЕСТИТЬ втТипПервойСтроки
	|ИЗ
	|	Документ.ЗаявкаНаВозврат.Товары КАК ЗаявкаНаВозвратТовары
	|ГДЕ
	|	ЗаявкаНаВозвратТовары.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЗаявкаНаВозвратТовары.Тип) КАК ТипВозвратаКоличествоРазличных,
	|	ЗаявкаНаВозвратТовары.Ссылка
	|ПОМЕСТИТЬ втКоличествоТипов
	|ИЗ
	|	Документ.ЗаявкаНаВозврат.Товары КАК ЗаявкаНаВозвратТовары
	|ГДЕ
	|	ЗаявкаНаВозвратТовары.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаявкаНаВозвратТовары.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втКоличествоТипов.ТипВозвратаКоличествоРазличных,
	|	втТипПервойСтроки.Тип
	|ИЗ
	|	втТипПервойСтроки КАК втТипПервойСтроки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втКоличествоТипов КАК втКоличествоТипов
	|		ПО втТипПервойСтроки.Ссылка = втКоличествоТипов.Ссылка";   
	
	ЗапросШапкаРекламация.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
	
	ВыборкаШапкаРекламация = ЗапросШапкаРекламация.Выполнить().Выбрать();
	
	Если ВыборкаШапкаРекламация.Следующий() и ВыборкаШапкаРекламация.ТипВозвратаКоличествоРазличных = 1 И ВыборкаШапкаРекламация.Тип = "Рекламация" Тогда
		
		ТипВозврата = "Возврат брака";
		ВозвратТовара = "Рекламация покупателя";

	Иначе
		
		ТипВозврата = "Возврат";
		ВозвратТовара = "Возврат товара";

	КонецЕсли;
	
	Если ЭтотОбъект.Реализация.ДоговорКонтрагента.РозничнаяПродажа Тогда
		ВозвратТовара = ВозвратТовара + " " + "(розн)";
	ИначеЕсли ЭтотОбъект.Реализация.ДоговорКонтрагента.ЛицевойСчет Тогда 
		ВозвратТовара = ВозвратТовара + " " + "(лиц.сч.)";
	КонецЕсли;	

	Если ВыборкаШапка.Следующий() Тогда  
		
		Обл   = Макет.ПолучитьОбласть("Заголовок");
		Обл.Параметры.Заполнить(ВыборкаШапка);
		Обл.Параметры.ВремяПечати = ТекущаяДата();  
		Обл.Параметры.Возврат = ТипВозврата;
		Обл.Параметры.ВозвратТовара = ВозвратТовара;
		
		Если ВыборкаШапка.СФНомер = "" Тогда 
			
			РеализацияНомер = ВыборкаШапка.РеализацияНомер;
			РеализацияДата = ВыборкаШапка.РеализацияДата;
			
		Иначе
			
			РеализацияНомер = ВыборкаШапка.СФНомер;
			РеализацияДата = ВыборкаШапка.СФДата;
			
		КонецЕсли;  
		
		ИмяРисункаШК = "D1";
		КоличествоМиллиметровВПикселе = 0.26;
		ПараметрыШтрихкода = Новый Структура;
		ПараметрыШтрихкода.Вставить("Ширина",          Окр(Обл.Рисунки[ИмяРисункаШК].Ширина / КоличествоМиллиметровВПикселе));
		ПараметрыШтрихкода.Вставить("Высота",          Окр(Обл.Рисунки[ИмяРисункаШК].Высота / КоличествоМиллиметровВПикселе));
		ПараметрыШтрихкода.Вставить("Штрихкод",        СокрЛП(ШтрихкодированиеПечатныхФорм.ЧисловойКодПоСсылке(Ссылка)));
		ПараметрыШтрихкода.Вставить("ТипКода",         4); // Code128
		ПараметрыШтрихкода.Вставить("ОтображатьТекст", Истина);
		ПараметрыШтрихкода.Вставить("РазмерШрифта",    9);
		
		Обл.Рисунки[ИмяРисункаШК].Картинка = ОбщегоНазначения.ПолучитьКартинкуШтрихкода(ПараметрыШтрихкода);
		
		ТабДокумент.Вывести(Обл);
		
		Обл = Макет.ПолучитьОбласть("Шапка");	
		ТабДокумент.Вывести(Обл);
		
	КонецЕсли;
	
	ЗапросТЧ = Новый Запрос;
	ЗапросТЧ.Текст = 
	"ВЫБРАТЬ
	|	ЗаявкаНаВозвратТовары.Ссылка,
	|	ЗаявкаНаВозвратТовары.НомерСтроки,
	|	ЗаявкаНаВозвратТовары.Номенклатура,
	|	ЗаявкаНаВозвратТовары.Количество,
	|	ЗаявкаНаВозвратТовары.Цена,
	|	ЗаявкаНаВозвратТовары.Сумма,
	|	ЗаявкаНаВозвратТовары.Тип,
	|	ЗаявкаНаВозвратТовары.Статус,
	|	ЗаявкаНаВозвратТовары.ЕдиницаИзмерения,
	|	ЗаявкаНаВозвратТовары.Комментарий,
	|	ЗаявкаНаВозвратТовары.IDСклада_СтороннийСклад,
	|	ЗаявкаНаВозвратТовары.Номенклатура.Артикул КАК Артикул,
	|	ЗаявкаНаВозвратТовары.Номенклатура.КодПроизводителя КАК КодПроизводителя,
	|	ЗаявкаНаВозвратТовары.Номенклатура.Родитель КАК Производитель,
	|	1 КАК Коэффициент,
	|	ЗаявкаНаВозвратТовары.Номенклатура.Наименование КАК Наименование
	|ИЗ
	|	Документ.ЗаявкаНаВозврат.Товары КАК ЗаявкаНаВозвратТовары
	|ГДЕ
	|	ЗаявкаНаВозвратТовары.Ссылка = &Ссылка";
	ЗапросТЧ.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
	
	ИтогоКоличество = 0;
	ИтогоСумма = 0;
	
	ВыборкаТЧ = ЗапросТЧ.Выполнить().Выбрать();
	Пока ВыборкаТЧ.Следующий() Цикл
		
		Обл = Макет.ПолучитьОбласть("Строка");
		Обл.Параметры.Заполнить(ВыборкаТЧ);
		Обл.Параметры.Реализация = РеализацияНомер + " от " + Формат(РеализацияДата, "ДФ=dd.MM.yyyy"); 
		Обл.Параметры.ПредставлениеТовара = ВыборкаТЧ.КодПроизводителя + " " + ВыборкаТЧ.Наименование;
		ИтогоКоличество = ИтогоКоличество + ВыборкаТЧ.Количество;
		ИтогоСумма = ИтогоСумма + ВыборкаТЧ.Сумма;
		
		ТабДокумент.Вывести(Обл);
		
	КонецЦикла;
	
	Обл = Макет.ПолучитьОбласть("Подвал");
	Обл.Параметры.Количество = ИтогоКоличество;
	Обл.Параметры.Сумма = ИтогоСумма;
	ТабДокумент.Вывести(Обл);
		
	Возврат ТабДокумент;
	
КонецФункции

Функция  ПечатьЗаявлениеНаВозвратФизЛица(ИмяМакета = "ЗаявлениеНаВозвратФизЛица", ОриентацияЛандшафт = Ложь) Экспорт

	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ЗаявлениеНаВозвратФизЛица";
	Макет = ПолучитьМакет(ИмяМакета);
	
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	СведенияОбОрганизации  = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Реализация.Организация, Дата,, Реализация.Организация.ОсновнойБанковскийСчет); 
	ОбластьШапка.Параметры.НаименованиеОрганизации = СведенияОбОрганизации.Представление;
	ОбластьШапка.Параметры.АдресОрганизации = СведенияОбОрганизации.ЮридическийАдрес;
	ОбластьШапка.Параметры.ИННКПП = СведенияОбОрганизации.ИНН + "/" + СведенияОбОрганизации.КПП;
	ОбластьШапка.Параметры.РасчетныйСчет = "Р/с " + СведенияОбОрганизации.НомерСчета;
	ОбластьШапка.Параметры.НаименованиеБанка = СведенияОбОрганизации.Банк;
	ОбластьШапка.Параметры.БикБанка = "БИК " + СведенияОбОрганизации.БИК;
	ОбластьШапка.Параметры.КоррСчет = "К/с " + СведенияОбОрганизации.КоррСчет;
	
	Если НЕ СведенияОбОрганизации.Банк = "" Тогда 
		ОбластьШапка.Параметры.ТелефонБанка = ?(ЗначениеЗаполнено(СведенияОбОрганизации.Банк.Телефоны), "Тел." + СведенияОбОрганизации.Банк.Телефоны, "");
	КонецЕсли;
	
	Руководители = РегламентированнаяОтчетность.ОтветственныеЛицаОрганизации(Реализация.Организация, Дата,);
	ОбластьШапка.Параметры.ФИОДиректора = ?(ЗначениеЗаполнено(Руководители.РуководительВДательномПлатеже), 
	   Руководители.РуководительВДательномПлатеже, Руководители.Руководитель);
	ОбластьШапка.Параметры.ДолжностьРуководителя = ?(ЗначениеЗаполнено(Руководители.РуководительДолжностьВДательномПадеже),
	   Руководители.РуководительДолжностьВДательномПадеже, ?(ЗначениеЗаполнено(Руководители.РуководительДолжность), Руководители.РуководительДолжность, "Генеральному директору"));
	ТабДокумент.Вывести(ОбластьШапка);
	
	ОбластьСтроки = Макет.ПолучитьОбласть("Строки");
	ОбластьСтроки.Параметры.ДатаРеализации = Формат(Реализация.Дата, "ДЛФ=DD");
	ПромСтрокаТовары = "";
	
	Для Каждого СтрокаТовары Из Товары Цикл
		ПромСтрокаТовары = ПромСтрокаТовары + ?(СокрЛП(ПромСтрокаТовары) = "", "", Символы.ПС) + СокрЛП(СтрокаТовары.Номенклатура.Наименование) 
		+ " " + СокрЛП(СтрокаТовары.Номенклатура.КодПроизводителя) + " " + СокрЛП(СтрокаТовары.Номенклатура.Родитель) + " - " + СтрокаТовары.Количество + " шт.";
	КонецЦикла;
	
	СуммаПоДокументу = Товары.Итог("Сумма");
	ОбластьСтроки.Параметры.СуммаВозврата = Формат(СуммаПоДокументу,"ЧДЦ=2; ЧРД=,; ЧГ=") + " руб. (" 
	             + ОбщегоНазначения.СформироватьСуммуПрописью(СуммаПоДокументу, Реализация.ВалютаДокумента) + ")";
	ОбластьСтроки.Параметры.СписокТоваров = ПромСтрокаТовары;  
	ТабДокумент.Вывести(ОбластьСтроки);
	
	ТаблицаЧеков = ПолучитьДанныеЧекаНаПечать();  
	
	Если ТаблицаЧеков.Количество() = 0 Тогда
		
		ОбластьЧек = Макет.ПолучитьОбласть("ОбластьЧек"); 
		ОбластьЧек.Параметры.Год = Формат(ТекущаяДата(), "ДФ=yyyy");
		ТабДокумент.Вывести(ОбластьЧек);
		
	Иначе     
		
		ОбластьЧекиШапка = Макет.ПолучитьОбласть("ОбластьЧекиШапка");
		ТабДокумент.Вывести(ОбластьЧекиШапка);
		
		Для Каждого СтрокаЧек Из ТаблицаЧеков Цикл
			
			ОбластьЧеки = Макет.ПолучитьОбласть("ОбластьЧеки");
			ОбластьЧеки.Параметры.Заполнить(СтрокаЧек);
			ОбластьЧеки.Параметры.ТипОснования = "кассовый чек №";
			ТабДокумент.Вывести(ОбластьЧеки);
			
		КонецЦикла;
		
	КонецЕсли;

	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	ОбластьПодвал.Параметры.Год = Формат(ТекущаяДата(), "ДФ=yyyy");
	ТабДокумент.Вывести(ОбластьПодвал); 
	
	ТабДокумент.АвтоМасштаб = Истина;  
	
	Если ОриентацияЛандшафт = Истина Тогда
		ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	КонецЕсли; 
	
	Возврат ТабДокумент;  
	
КонецФункции

Функция ПолучитьДанныеЧекаНаПечать()  Экспорт
	
	ТаблицаЧеков = Новый ТаблицаЗначений;
	ТаблицаЧеков.Колонки.Добавить("НомерЧека");
	ТаблицаЧеков.Колонки.Добавить("ДатаЧека"); 
	
	ТекстВозврат = "";
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗаявкаНаВозврат.Реализация
	|ПОМЕСТИТЬ ВтРеализация
	|ИЗ
	|	Документ.ЗаявкаНаВозврат КАК ЗаявкаНаВозврат
	|ГДЕ
	|	ЗаявкаНаВозврат.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.НомерЧекаККМ КАК НомерЧекаККМ,
	|	ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.Дата КАК Дата
	|ИЗ
	|	Документ.ПриходныйКассовыйОрдер.РасшифровкаПлатежа КАК ПриходныйКассовыйОрдерРасшифровкаПлатежа
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтРеализация КАК ВтРеализация
	|		ПО ПриходныйКассовыйОрдерРасшифровкаПлатежа.ДокументРасчетовСКонтрагентом = ВтРеализация.Реализация
	|			И (ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.Аннулирован = ЛОЖЬ)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ОплатаОтПокупателяПлатежнойКартойРасшифровкаПлатежа.Ссылка.НомерЧекаККМ,
	|	ОплатаОтПокупателяПлатежнойКартойРасшифровкаПлатежа.Ссылка.Дата
	|ИЗ
	|	ВтРеализация КАК ВтРеализация
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОплатаОтПокупателяПлатежнойКартой.РасшифровкаПлатежа КАК ОплатаОтПокупателяПлатежнойКартойРасшифровкаПлатежа
	|		ПО ВтРеализация.Реализация = ОплатаОтПокупателяПлатежнойКартойРасшифровкаПлатежа.ДокументРасчетовСКонтрагентом
	|			И (ОплатаОтПокупателяПлатежнойКартойРасшифровкаПлатежа.Ссылка.ВидОперации = &ВидОперации)";  
	
	Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);  
	Запрос.УстановитьПараметр("ВидОперации", Перечисления.ВидыОперацийОплатаОтПокупателяПлатежнойКартой.ОплатаПокупателя);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл   
		
		Если Не ЗначениеЗаполнено(Выборка.НомерЧекаККМ) Тогда
			Продолжить;
		КонецЕсли;  
		
		НовСтрока = ТаблицаЧеков.Добавить();
		НовСтрока.НомерЧека = СокрЛП(Выборка.НомерЧекаККМ);
		НовСтрока.ДатаЧека = Формат(Выборка.Дата, "ДЛФ=DD"); 
		
	КонецЦикла;
	
	Возврат ТаблицаЧеков;
	
КонецФункции

// Процедура осуществляет печать документа. Можно направить печать на 
// экран или принтер, а также распечатать необходмое количество копий.
//
//  Название макета печати передается в качестве параметра,
// по переданному названию находим имя макета в соответствии.
//
// Параметры:
//  НазваниеМакета - строка, название макета.
//
Процедура Печать(ИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь) Экспорт

	Если Не РаботаСДиалогами.ПроверитьМодифицированность(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	// Получить экземпляр документа на печать
	Если ИмяМакета = "Претензия" Тогда
		ТабДокумент = ПечатьПретензии();	
	ИначеЕсли ИмяМакета = "Возврат" Тогда
		ТабДокумент = ПечатьВозврата();
	ИначеЕсли ИмяМакета = "ЗаявлениеНаВозвратФизЛица" Тогда
		ТабДокумент = ПечатьЗаявлениеНаВозвратФизЛица();
	ИначеЕсли ТипЗнч(ИмяМакета) = Тип("ДвоичныеДанные") Тогда

		ТабДокумент = УниверсальныеМеханизмы.НапечататьВнешнююФорму(Ссылка, ИмяМакета);
		
		Если ТабДокумент = Неопределено Тогда
			Возврат
		КонецЕсли; 
				
	КонецЕсли;
	
	УниверсальныеМеханизмы.НапечататьДокумент(ТабДокумент, КоличествоЭкземпляров, НаПринтер, ОбщегоНазначения.СформироватьЗаголовокДокумента(ЭтотОбъект), Ссылка);

КонецПроцедуры // Печать

// Возвращает доступные варианты печати документа
//
// Вовращаемое значение:
//  Струткура, каждая строка которой соответствует одному из вариантов печати
//  
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт	
	
	Структура = Новый Структура;
	Структура.Вставить("Возврат", "Возврат"); 
	
	Если Реализация.ДоговорКонтрагента.РозничнаяПродажа Тогда
		Структура.Вставить("ЗаявлениеНаВозвратФизЛица", "Заявление (для розничных продаж)");
	Иначе
		Структура.Вставить("Претензия", "Претензия");
	КонецЕсли;
	
	Возврат Структура;  
КонецФункции // ПолучитьСтруктуруПечатныхФорм()

#КонецЕсли
